app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        id = params[:id]
        todo = Todo.find(id)

INSERT INTO "todos" ("todo_text", "due_date", "completed", "important", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["todo_text", "buy phone"], ["due_date", "2022-09-01"], ["completed", false], ["important", false], ["created_at", "2022-09-01 07:06:19.811426"], ["updated_at", "2022-09-01 07:06:19.811426"]]
---
    def create
        todo_text = params[:todo_text]
        due_date = DateTime.parse(params[:due_date])
        new_todo = Todo.create!(
            todo_text: todo_text,
            due_date: due_date,
            completed: false,
            important: false
        )

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["completed", true], ["updated_at", "2022-09-01 07:06:21.968654"], ["id", 2]]
---
    def update
        id = params[:id]
        completed = params[:completed]
        todo = Todo.find(id)
        todo.completed = completed
        todo.save!

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "todos" SET "important" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["important", nil], ["updated_at", "2022-09-04 15:06:17.445007"], ["id", 7]]
---
    def importantTodo
        id = params[:id]
        important = params[:important]
        todo = Todo.find(id)
        todo.important = important
        todo.save!

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 2]]
---
    def destroy
        id = params[:id]
        todo = Todo.find(id)
        todo.destroy