app/controllers/users_controller.rb

    def create
        User.create!(
            firstname: params[:firstname],
            lastname: params[:lastname],
            email: params[:email],
            password: params[:password]
        )
---
INSERT INTO "users" ("firstname", "lastname", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["firstname", nil], ["lastname", nil], ["email", "abcd@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-09-04 12:13:52.301040"], ["updated_at", "2022-09-04 12:13:52.301040"]]